Revit 2027 API
FabricationPartSizeMap.MappedDepth Property
 The mapped size for the depth of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MappedDepth { get; set; }
Public Property MappedDepth As Double
	Get
	Set
public:
property double MappedDepth {
	double get ();
	void set (double value);
}
member MappedDepth : float with get, set
Property Value
Double
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace